espressif/esp-idf/components/soc/esp32c5/register/soc/sdio_slc_host_reg.h
/** SDIO_SLC_HOST_SLC1HOST_INT_RAW_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1HOST_INT_RAW_REG (DR_REG_SLCHOST_BASE + 0x54)
/** SDIO_SLC_HOST_SLC1_TOHOST_BIT0_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT0_INT_RAW    (BIT(0))
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT0_INT_RAW_M  (SDIO_SLC_HOST_SLC1_TOHOST_BIT0_INT_RAW_V << SDIO_SLC_HOST_SLC1_TOHOST_BIT0_INT_RAW_S)
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT0_INT_RAW_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT0_INT_RAW_S  0
/** SDIO_SLC_HOST_SLC1_TOHOST_BIT1_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT1_INT_RAW    (BIT(1))
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT1_INT_RAW_M  (SDIO_SLC_HOST_SLC1_TOHOST_BIT1_INT_RAW_V << SDIO_SLC_HOST_SLC1_TOHOST_BIT1_INT_RAW_S)
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT1_INT_RAW_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT1_INT_RAW_S  1
/** SDIO_SLC_HOST_SLC1_TOHOST_BIT2_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT2_INT_RAW    (BIT(2))
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT2_INT_RAW_M  (SDIO_SLC_HOST_SLC1_TOHOST_BIT2_INT_RAW_V << SDIO_SLC_HOST_SLC1_TOHOST_BIT2_INT_RAW_S)
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT2_INT_RAW_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT2_INT_RAW_S  2
/** SDIO_SLC_HOST_SLC1_TOHOST_BIT3_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT3_INT_RAW    (BIT(3))
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT3_INT_RAW_M  (SDIO_SLC_HOST_SLC1_TOHOST_BIT3_INT_RAW_V << SDIO_SLC_HOST_SLC1_TOHOST_BIT3_INT_RAW_S)
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT3_INT_RAW_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT3_INT_RAW_S  3
/** SDIO_SLC_HOST_SLC1_TOHOST_BIT4_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT4_INT_RAW    (BIT(4))
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT4_INT_RAW_M  (SDIO_SLC_HOST_SLC1_TOHOST_BIT4_INT_RAW_V << SDIO_SLC_HOST_SLC1_TOHOST_BIT4_INT_RAW_S)
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT4_INT_RAW_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT4_INT_RAW_S  4
/** SDIO_SLC_HOST_SLC1_TOHOST_BIT5_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT5_INT_RAW    (BIT(5))
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT5_INT_RAW_M  (SDIO_SLC_HOST_SLC1_TOHOST_BIT5_INT_RAW_V << SDIO_SLC_HOST_SLC1_TOHOST_BIT5_INT_RAW_S)
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT5_INT_RAW_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT5_INT_RAW_S  5
/** SDIO_SLC_HOST_SLC1_TOHOST_BIT6_INT_RAW : R/WTC/SS/SC; bitpos: [6]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT6_INT_RAW    (BIT(6))
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT6_INT_RAW_M  (SDIO_SLC_HOST_SLC1_TOHOST_BIT6_INT_RAW_V << SDIO_SLC_HOST_SLC1_TOHOST_BIT6_INT_RAW_S)
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT6_INT_RAW_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT6_INT_RAW_S  6
/** SDIO_SLC_HOST_SLC1_TOHOST_BIT7_INT_RAW : R/WTC/SS/SC; bitpos: [7]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT7_INT_RAW    (BIT(7))
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT7_INT_RAW_M  (SDIO_SLC_HOST_SLC1_TOHOST_BIT7_INT_RAW_V << SDIO_SLC_HOST_SLC1_TOHOST_BIT7_INT_RAW_S)
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT7_INT_RAW_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT7_INT_RAW_S  7
/** SDIO_SLC_HOST_SLC1_TOKEN0_1TO0_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOKEN0_1TO0_INT_RAW    (BIT(8))
#define SDIO_SLC_HOST_SLC1_TOKEN0_1TO0_INT_RAW_M  (SDIO_SLC_HOST_SLC1_TOKEN0_1TO0_INT_RAW_V << SDIO_SLC_HOST_SLC1_TOKEN0_1TO0_INT_RAW_S)
#define SDIO_SLC_HOST_SLC1_TOKEN0_1TO0_INT_RAW_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOKEN0_1TO0_INT_RAW_S  8
/** SDIO_SLC_HOST_SLC1_TOKEN1_1TO0_INT_RAW : R/WTC/SS; bitpos: [9]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOKEN1_1TO0_INT_RAW    (BIT(9))
#define SDIO_SLC_HOST_SLC1_TOKEN1_1TO0_INT_RAW_M  (SDIO_SLC_HOST_SLC1_TOKEN1_1TO0_INT_RAW_V << SDIO_SLC_HOST_SLC1_TOKEN1_1TO0_INT_RAW_S)
#define SDIO_SLC_HOST_SLC1_TOKEN1_1TO0_INT_RAW_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOKEN1_1TO0_INT_RAW_S  9
/** SDIO_SLC_HOST_SLC1_TOKEN0_0TO1_INT_RAW : R/WTC/SS; bitpos: [10]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOKEN0_0TO1_INT_RAW    (BIT(10))
#define SDIO_SLC_HOST_SLC1_TOKEN0_0TO1_INT_RAW_M  (SDIO_SLC_HOST_SLC1_TOKEN0_0TO1_INT_RAW_V << SDIO_SLC_HOST_SLC1_TOKEN0_0TO1_INT_RAW_S)
#define SDIO_SLC_HOST_SLC1_TOKEN0_0TO1_INT_RAW_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOKEN0_0TO1_INT_RAW_S  10
/** SDIO_SLC_HOST_SLC1_TOKEN1_0TO1_INT_RAW : R/WTC/SS; bitpos: [11]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOKEN1_0TO1_INT_RAW    (BIT(11))
#define SDIO_SLC_HOST_SLC1_TOKEN1_0TO1_INT_RAW_M  (SDIO_SLC_HOST_SLC1_TOKEN1_0TO1_INT_RAW_V << SDIO_SLC_HOST_SLC1_TOKEN1_0TO1_INT_RAW_S)
#define SDIO_SLC_HOST_SLC1_TOKEN1_0TO1_INT_RAW_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOKEN1_0TO1_INT_RAW_S  11
/** SDIO_SLC_HOST_SLC1HOST_RX_SOF_INT_RAW : R/WTC/SS; bitpos: [12]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1HOST_RX_SOF_INT_RAW    (BIT(12))
#define SDIO_SLC_HOST_SLC1HOST_RX_SOF_INT_RAW_M  (SDIO_SLC_HOST_SLC1HOST_RX_SOF_INT_RAW_V << SDIO_SLC_HOST_SLC1HOST_RX_SOF_INT_RAW_S)
#define SDIO_SLC_HOST_SLC1HOST_RX_SOF_INT_RAW_V  0x00000001U
#define SDIO_SLC_HOST_SLC1HOST_RX_SOF_INT_RAW_S  12
/** SDIO_SLC_HOST_SLC1HOST_RX_EOF_INT_RAW : R/WTC/SS; bitpos: [13]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1HOST_RX_EOF_INT_RAW    (BIT(13))
#define SDIO_SLC_HOST_SLC1HOST_RX_EOF_INT_RAW_M  (SDIO_SLC_HOST_SLC1HOST_RX_EOF_INT_RAW_V << SDIO_SLC_HOST_SLC1HOST_RX_EOF_INT_RAW_S)
#define SDIO_SLC_HOST_SLC1HOST_RX_EOF_INT_RAW_V  0x00000001U
#define SDIO_SLC_HOST_SLC1HOST_RX_EOF_INT_RAW_S  13
/** SDIO_SLC_HOST_SLC1HOST_RX_START_INT_RAW : R/WTC/SS; bitpos: [14]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1HOST_RX_START_INT_RAW    (BIT(14))
#define SDIO_SLC_HOST_SLC1HOST_RX_START_INT_RAW_M  (SDIO_SLC_HOST_SLC1HOST_RX_START_INT_RAW_V << SDIO_SLC_HOST_SLC1HOST_RX_START_INT_RAW_S)
#define SDIO_SLC_HOST_SLC1HOST_RX_START_INT_RAW_V  0x00000001U
#define SDIO_SLC_HOST_SLC1HOST_RX_START_INT_RAW_S  14
/** SDIO_SLC_HOST_SLC1HOST_TX_START_INT_RAW : R/WTC/SS; bitpos: [15]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1HOST_TX_START_INT_RAW    (BIT(15))
#define SDIO_SLC_HOST_SLC1HOST_TX_START_INT_RAW_M  (SDIO_SLC_HOST_SLC1HOST_TX_START_INT_RAW_V << SDIO_SLC_HOST_SLC1HOST_TX_START_INT_RAW_S)
#define SDIO_SLC_HOST_SLC1HOST_TX_START_INT_RAW_V  0x00000001U
#define SDIO_SLC_HOST_SLC1HOST_TX_START_INT_RAW_S  15
/** SDIO_SLC_HOST_SLC1_RX_UDF_INT_RAW : R/WTC/SS; bitpos: [16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_RX_UDF_INT_RAW    (BIT(16))
#define SDIO_SLC_HOST_SLC1_RX_UDF_INT_RAW_M  (SDIO_SLC_HOST_SLC1_RX_UDF_INT_RAW_V << SDIO_SLC_HOST_SLC1_RX_UDF_INT_RAW_S)
#define SDIO_SLC_HOST_SLC1_RX_UDF_INT_RAW_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_RX_UDF_INT_RAW_S  16
/** SDIO_SLC_HOST_SLC1_TX_OVF_INT_RAW : R/WTC/SS; bitpos: [17]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TX_OVF_INT_RAW    (BIT(17))
#define SDIO_SLC_HOST_SLC1_TX_OVF_INT_RAW_M  (SDIO_SLC_HOST_SLC1_TX_OVF_INT_RAW_V << SDIO_SLC_HOST_SLC1_TX_OVF_INT_RAW_S)
#define SDIO_SLC_HOST_SLC1_TX_OVF_INT_RAW_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TX_OVF_INT_RAW_S  17
/** SDIO_SLC_HOST_SLC1_RX_PF_VALID_INT_RAW : R/WTC/SS; bitpos: [18]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_RX_PF_VALID_INT_RAW    (BIT(18))
#define SDIO_SLC_HOST_SLC1_RX_PF_VALID_INT_RAW_M  (SDIO_SLC_HOST_SLC1_RX_PF_VALID_INT_RAW_V << SDIO_SLC_HOST_SLC1_RX_PF_VALID_INT_RAW_S)
#define SDIO_SLC_HOST_SLC1_RX_PF_VALID_INT_RAW_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_RX_PF_VALID_INT_RAW_S  18
/** SDIO_SLC_HOST_SLC1_EXT_BIT0_INT_RAW : R/WTC/SS; bitpos: [19]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_EXT_BIT0_INT_RAW    (BIT(19))
#define SDIO_SLC_HOST_SLC1_EXT_BIT0_INT_RAW_M  (SDIO_SLC_HOST_SLC1_EXT_BIT0_INT_RAW_V << SDIO_SLC_HOST_SLC1_EXT_BIT0_INT_RAW_S)
#define SDIO_SLC_HOST_SLC1_EXT_BIT0_INT_RAW_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_EXT_BIT0_INT_RAW_S  19
/** SDIO_SLC_HOST_SLC1_EXT_BIT1_INT_RAW : R/WTC/SS; bitpos: [20]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_EXT_BIT1_INT_RAW    (BIT(20))
#define SDIO_SLC_HOST_SLC1_EXT_BIT1_INT_RAW_M  (SDIO_SLC_HOST_SLC1_EXT_BIT1_INT_RAW_V << SDIO_SLC_HOST_SLC1_EXT_BIT1_INT_RAW_S)
#define SDIO_SLC_HOST_SLC1_EXT_BIT1_INT_RAW_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_EXT_BIT1_INT_RAW_S  20
/** SDIO_SLC_HOST_SLC1_EXT_BIT2_INT_RAW : R/WTC/SS; bitpos: [21]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_EXT_BIT2_INT_RAW    (BIT(21))
#define SDIO_SLC_HOST_SLC1_EXT_BIT2_INT_RAW_M  (SDIO_SLC_HOST_SLC1_EXT_BIT2_INT_RAW_V << SDIO_SLC_HOST_SLC1_EXT_BIT2_INT_RAW_S)
#define SDIO_SLC_HOST_SLC1_EXT_BIT2_INT_RAW_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_EXT_BIT2_INT_RAW_S  21
/** SDIO_SLC_HOST_SLC1_EXT_BIT3_INT_RAW : R/WTC/SS; bitpos: [22]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_EXT_BIT3_INT_RAW    (BIT(22))
#define SDIO_SLC_HOST_SLC1_EXT_BIT3_INT_RAW_M  (SDIO_SLC_HOST_SLC1_EXT_BIT3_INT_RAW_V << SDIO_SLC_HOST_SLC1_EXT_BIT3_INT_RAW_S)
#define SDIO_SLC_HOST_SLC1_EXT_BIT3_INT_RAW_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_EXT_BIT3_INT_RAW_S  22
/** SDIO_SLC_HOST_SLC1_WIFI_RX_NEW_PACKET_INT_RAW : R/WTC/SS; bitpos: [23]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_WIFI_RX_NEW_PACKET_INT_RAW    (BIT(23))
#define SDIO_SLC_HOST_SLC1_WIFI_RX_NEW_PACKET_INT_RAW_M  (SDIO_SLC_HOST_SLC1_WIFI_RX_NEW_PACKET_INT_RAW_V << SDIO_SLC_HOST_SLC1_WIFI_RX_NEW_PACKET_INT_RAW_S)
#define SDIO_SLC_HOST_SLC1_WIFI_RX_NEW_PACKET_INT_RAW_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_WIFI_RX_NEW_PACKET_INT_RAW_S  23
/** SDIO_SLC_HOST_SLC1_HOST_RD_RETRY_INT_RAW : R/WTC/SS; bitpos: [24]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_HOST_RD_RETRY_INT_RAW    (BIT(24))
#define SDIO_SLC_HOST_SLC1_HOST_RD_RETRY_INT_RAW_M  (SDIO_SLC_HOST_SLC1_HOST_RD_RETRY_INT_RAW_V << SDIO_SLC_HOST_SLC1_HOST_RD_RETRY_INT_RAW_S)
#define SDIO_SLC_HOST_SLC1_HOST_RD_RETRY_INT_RAW_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_HOST_RD_RETRY_INT_RAW_S  24
/** SDIO_SLC_HOST_SLC1_BT_RX_NEW_PACKET_INT_RAW : R/WTC/SS; bitpos: [25]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_BT_RX_NEW_PACKET_INT_RAW    (BIT(25))
#define SDIO_SLC_HOST_SLC1_BT_RX_NEW_PACKET_INT_RAW_M  (SDIO_SLC_HOST_SLC1_BT_RX_NEW_PACKET_INT_RAW_V << SDIO_SLC_HOST_SLC1_BT_RX_NEW_PACKET_INT_RAW_S)
#define SDIO_SLC_HOST_SLC1_BT_RX_NEW_PACKET_INT_RAW_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_BT_RX_NEW_PACKET_INT_RAW_S  25

/** SDIO_SLC_HOST_SLC0HOST_INT_ST_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0HOST_INT_ST_REG (DR_REG_SLCHOST_BASE + 0x58)
/** SDIO_SLC_HOST_SLC0_TOHOST_BIT0_INT_ST : RO; bitpos: [0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT0_INT_ST    (BIT(0))
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT0_INT_ST_M  (SDIO_SLC_HOST_SLC0_TOHOST_BIT0_INT_ST_V << SDIO_SLC_HOST_SLC0_TOHOST_BIT0_INT_ST_S)
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT0_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT0_INT_ST_S  0
/** SDIO_SLC_HOST_SLC0_TOHOST_BIT1_INT_ST : RO; bitpos: [1]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT1_INT_ST    (BIT(1))
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT1_INT_ST_M  (SDIO_SLC_HOST_SLC0_TOHOST_BIT1_INT_ST_V << SDIO_SLC_HOST_SLC0_TOHOST_BIT1_INT_ST_S)
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT1_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT1_INT_ST_S  1
/** SDIO_SLC_HOST_SLC0_TOHOST_BIT2_INT_ST : RO; bitpos: [2]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT2_INT_ST    (BIT(2))
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT2_INT_ST_M  (SDIO_SLC_HOST_SLC0_TOHOST_BIT2_INT_ST_V << SDIO_SLC_HOST_SLC0_TOHOST_BIT2_INT_ST_S)
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT2_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT2_INT_ST_S  2
/** SDIO_SLC_HOST_SLC0_TOHOST_BIT3_INT_ST : RO; bitpos: [3]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT3_INT_ST    (BIT(3))
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT3_INT_ST_M  (SDIO_SLC_HOST_SLC0_TOHOST_BIT3_INT_ST_V << SDIO_SLC_HOST_SLC0_TOHOST_BIT3_INT_ST_S)
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT3_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT3_INT_ST_S  3
/** SDIO_SLC_HOST_SLC0_TOHOST_BIT4_INT_ST : RO; bitpos: [4]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT4_INT_ST    (BIT(4))
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT4_INT_ST_M  (SDIO_SLC_HOST_SLC0_TOHOST_BIT4_INT_ST_V << SDIO_SLC_HOST_SLC0_TOHOST_BIT4_INT_ST_S)
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT4_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT4_INT_ST_S  4
/** SDIO_SLC_HOST_SLC0_TOHOST_BIT5_INT_ST : RO; bitpos: [5]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT5_INT_ST    (BIT(5))
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT5_INT_ST_M  (SDIO_SLC_HOST_SLC0_TOHOST_BIT5_INT_ST_V << SDIO_SLC_HOST_SLC0_TOHOST_BIT5_INT_ST_S)
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT5_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT5_INT_ST_S  5
/** SDIO_SLC_HOST_SLC0_TOHOST_BIT6_INT_ST : RO; bitpos: [6]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT6_INT_ST    (BIT(6))
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT6_INT_ST_M  (SDIO_SLC_HOST_SLC0_TOHOST_BIT6_INT_ST_V << SDIO_SLC_HOST_SLC0_TOHOST_BIT6_INT_ST_S)
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT6_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT6_INT_ST_S  6
/** SDIO_SLC_HOST_SLC0_TOHOST_BIT7_INT_ST : RO; bitpos: [7]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT7_INT_ST    (BIT(7))
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT7_INT_ST_M  (SDIO_SLC_HOST_SLC0_TOHOST_BIT7_INT_ST_V << SDIO_SLC_HOST_SLC0_TOHOST_BIT7_INT_ST_S)
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT7_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT7_INT_ST_S  7
/** SDIO_SLC_HOST_SLC0_TOKEN0_1TO0_INT_ST : RO; bitpos: [8]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_TOKEN0_1TO0_INT_ST    (BIT(8))
#define SDIO_SLC_HOST_SLC0_TOKEN0_1TO0_INT_ST_M  (SDIO_SLC_HOST_SLC0_TOKEN0_1TO0_INT_ST_V << SDIO_SLC_HOST_SLC0_TOKEN0_1TO0_INT_ST_S)
#define SDIO_SLC_HOST_SLC0_TOKEN0_1TO0_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_TOKEN0_1TO0_INT_ST_S  8
/** SDIO_SLC_HOST_SLC0_TOKEN1_1TO0_INT_ST : RO; bitpos: [9]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_TOKEN1_1TO0_INT_ST    (BIT(9))
#define SDIO_SLC_HOST_SLC0_TOKEN1_1TO0_INT_ST_M  (SDIO_SLC_HOST_SLC0_TOKEN1_1TO0_INT_ST_V << SDIO_SLC_HOST_SLC0_TOKEN1_1TO0_INT_ST_S)
#define SDIO_SLC_HOST_SLC0_TOKEN1_1TO0_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_TOKEN1_1TO0_INT_ST_S  9
/** SDIO_SLC_HOST_SLC0_TOKEN0_0TO1_INT_ST : RO; bitpos: [10]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_TOKEN0_0TO1_INT_ST    (BIT(10))
#define SDIO_SLC_HOST_SLC0_TOKEN0_0TO1_INT_ST_M  (SDIO_SLC_HOST_SLC0_TOKEN0_0TO1_INT_ST_V << SDIO_SLC_HOST_SLC0_TOKEN0_0TO1_INT_ST_S)
#define SDIO_SLC_HOST_SLC0_TOKEN0_0TO1_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_TOKEN0_0TO1_INT_ST_S  10
/** SDIO_SLC_HOST_SLC0_TOKEN1_0TO1_INT_ST : RO; bitpos: [11]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_TOKEN1_0TO1_INT_ST    (BIT(11))
#define SDIO_SLC_HOST_SLC0_TOKEN1_0TO1_INT_ST_M  (SDIO_SLC_HOST_SLC0_TOKEN1_0TO1_INT_ST_V << SDIO_SLC_HOST_SLC0_TOKEN1_0TO1_INT_ST_S)
#define SDIO_SLC_HOST_SLC0_TOKEN1_0TO1_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_TOKEN1_0TO1_INT_ST_S  11
/** SDIO_SLC_HOST_SLC0HOST_RX_SOF_INT_ST : RO; bitpos: [12]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0HOST_RX_SOF_INT_ST    (BIT(12))
#define SDIO_SLC_HOST_SLC0HOST_RX_SOF_INT_ST_M  (SDIO_SLC_HOST_SLC0HOST_RX_SOF_INT_ST_V << SDIO_SLC_HOST_SLC0HOST_RX_SOF_INT_ST_S)
#define SDIO_SLC_HOST_SLC0HOST_RX_SOF_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC0HOST_RX_SOF_INT_ST_S  12
/** SDIO_SLC_HOST_SLC0HOST_RX_EOF_INT_ST : RO; bitpos: [13]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0HOST_RX_EOF_INT_ST    (BIT(13))
#define SDIO_SLC_HOST_SLC0HOST_RX_EOF_INT_ST_M  (SDIO_SLC_HOST_SLC0HOST_RX_EOF_INT_ST_V << SDIO_SLC_HOST_SLC0HOST_RX_EOF_INT_ST_S)
#define SDIO_SLC_HOST_SLC0HOST_RX_EOF_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC0HOST_RX_EOF_INT_ST_S  13
/** SDIO_SLC_HOST_SLC0HOST_RX_START_INT_ST : RO; bitpos: [14]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0HOST_RX_START_INT_ST    (BIT(14))
#define SDIO_SLC_HOST_SLC0HOST_RX_START_INT_ST_M  (SDIO_SLC_HOST_SLC0HOST_RX_START_INT_ST_V << SDIO_SLC_HOST_SLC0HOST_RX_START_INT_ST_S)
#define SDIO_SLC_HOST_SLC0HOST_RX_START_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC0HOST_RX_START_INT_ST_S  14
/** SDIO_SLC_HOST_SLC0HOST_TX_START_INT_ST : RO; bitpos: [15]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0HOST_TX_START_INT_ST    (BIT(15))
#define SDIO_SLC_HOST_SLC0HOST_TX_START_INT_ST_M  (SDIO_SLC_HOST_SLC0HOST_TX_START_INT_ST_V << SDIO_SLC_HOST_SLC0HOST_TX_START_INT_ST_S)
#define SDIO_SLC_HOST_SLC0HOST_TX_START_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC0HOST_TX_START_INT_ST_S  15
/** SDIO_SLC_HOST_SLC0_RX_UDF_INT_ST : RO; bitpos: [16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_RX_UDF_INT_ST    (BIT(16))
#define SDIO_SLC_HOST_SLC0_RX_UDF_INT_ST_M  (SDIO_SLC_HOST_SLC0_RX_UDF_INT_ST_V << SDIO_SLC_HOST_SLC0_RX_UDF_INT_ST_S)
#define SDIO_SLC_HOST_SLC0_RX_UDF_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_RX_UDF_INT_ST_S  16
/** SDIO_SLC_HOST_SLC0_TX_OVF_INT_ST : RO; bitpos: [17]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_TX_OVF_INT_ST    (BIT(17))
#define SDIO_SLC_HOST_SLC0_TX_OVF_INT_ST_M  (SDIO_SLC_HOST_SLC0_TX_OVF_INT_ST_V << SDIO_SLC_HOST_SLC0_TX_OVF_INT_ST_S)
#define SDIO_SLC_HOST_SLC0_TX_OVF_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_TX_OVF_INT_ST_S  17
/** SDIO_SLC_HOST_SLC0_RX_PF_VALID_INT_ST : RO; bitpos: [18]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_RX_PF_VALID_INT_ST    (BIT(18))
#define SDIO_SLC_HOST_SLC0_RX_PF_VALID_INT_ST_M  (SDIO_SLC_HOST_SLC0_RX_PF_VALID_INT_ST_V << SDIO_SLC_HOST_SLC0_RX_PF_VALID_INT_ST_S)
#define SDIO_SLC_HOST_SLC0_RX_PF_VALID_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_RX_PF_VALID_INT_ST_S  18
/** SDIO_SLC_HOST_SLC0_EXT_BIT0_INT_ST : RO; bitpos: [19]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_EXT_BIT0_INT_ST    (BIT(19))
#define SDIO_SLC_HOST_SLC0_EXT_BIT0_INT_ST_M  (SDIO_SLC_HOST_SLC0_EXT_BIT0_INT_ST_V << SDIO_SLC_HOST_SLC0_EXT_BIT0_INT_ST_S)
#define SDIO_SLC_HOST_SLC0_EXT_BIT0_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_EXT_BIT0_INT_ST_S  19
/** SDIO_SLC_HOST_SLC0_EXT_BIT1_INT_ST : RO; bitpos: [20]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_EXT_BIT1_INT_ST    (BIT(20))
#define SDIO_SLC_HOST_SLC0_EXT_BIT1_INT_ST_M  (SDIO_SLC_HOST_SLC0_EXT_BIT1_INT_ST_V << SDIO_SLC_HOST_SLC0_EXT_BIT1_INT_ST_S)
#define SDIO_SLC_HOST_SLC0_EXT_BIT1_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_EXT_BIT1_INT_ST_S  20
/** SDIO_SLC_HOST_SLC0_EXT_BIT2_INT_ST : RO; bitpos: [21]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_EXT_BIT2_INT_ST    (BIT(21))
#define SDIO_SLC_HOST_SLC0_EXT_BIT2_INT_ST_M  (SDIO_SLC_HOST_SLC0_EXT_BIT2_INT_ST_V << SDIO_SLC_HOST_SLC0_EXT_BIT2_INT_ST_S)
#define SDIO_SLC_HOST_SLC0_EXT_BIT2_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_EXT_BIT2_INT_ST_S  21
/** SDIO_SLC_HOST_SLC0_EXT_BIT3_INT_ST : RO; bitpos: [22]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_EXT_BIT3_INT_ST    (BIT(22))
#define SDIO_SLC_HOST_SLC0_EXT_BIT3_INT_ST_M  (SDIO_SLC_HOST_SLC0_EXT_BIT3_INT_ST_V << SDIO_SLC_HOST_SLC0_EXT_BIT3_INT_ST_S)
#define SDIO_SLC_HOST_SLC0_EXT_BIT3_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_EXT_BIT3_INT_ST_S  22
/** SDIO_SLC_HOST_SLC0_RX_NEW_PACKET_INT_ST : RO; bitpos: [23]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_RX_NEW_PACKET_INT_ST    (BIT(23))
#define SDIO_SLC_HOST_SLC0_RX_NEW_PACKET_INT_ST_M  (SDIO_SLC_HOST_SLC0_RX_NEW_PACKET_INT_ST_V << SDIO_SLC_HOST_SLC0_RX_NEW_PACKET_INT_ST_S)
#define SDIO_SLC_HOST_SLC0_RX_NEW_PACKET_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_RX_NEW_PACKET_INT_ST_S  23
/** SDIO_SLC_HOST_SLC0_HOST_RD_RETRY_INT_ST : RO; bitpos: [24]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_HOST_RD_RETRY_INT_ST    (BIT(24))
#define SDIO_SLC_HOST_SLC0_HOST_RD_RETRY_INT_ST_M  (SDIO_SLC_HOST_SLC0_HOST_RD_RETRY_INT_ST_V << SDIO_SLC_HOST_SLC0_HOST_RD_RETRY_INT_ST_S)
#define SDIO_SLC_HOST_SLC0_HOST_RD_RETRY_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_HOST_RD_RETRY_INT_ST_S  24
/** SDIO_SLC_HOST_GPIO_SDIO_INT_ST : RO; bitpos: [25]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_GPIO_SDIO_INT_ST    (BIT(25))
#define SDIO_SLC_HOST_GPIO_SDIO_INT_ST_M  (SDIO_SLC_HOST_GPIO_SDIO_INT_ST_V << SDIO_SLC_HOST_GPIO_SDIO_INT_ST_S)
#define SDIO_SLC_HOST_GPIO_SDIO_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_GPIO_SDIO_INT_ST_S  25

