espressif/esp-idf/components/soc/esp32c5/register/soc/sdio_slc_host_reg.h
/** SDIO_SLC_HOST_SLC1HOST_INT_ST_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1HOST_INT_ST_REG (DR_REG_SLCHOST_BASE + 0x5c)
/** SDIO_SLC_HOST_SLC1_TOHOST_BIT0_INT_ST : RO; bitpos: [0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT0_INT_ST    (BIT(0))
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT0_INT_ST_M  (SDIO_SLC_HOST_SLC1_TOHOST_BIT0_INT_ST_V << SDIO_SLC_HOST_SLC1_TOHOST_BIT0_INT_ST_S)
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT0_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT0_INT_ST_S  0
/** SDIO_SLC_HOST_SLC1_TOHOST_BIT1_INT_ST : RO; bitpos: [1]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT1_INT_ST    (BIT(1))
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT1_INT_ST_M  (SDIO_SLC_HOST_SLC1_TOHOST_BIT1_INT_ST_V << SDIO_SLC_HOST_SLC1_TOHOST_BIT1_INT_ST_S)
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT1_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT1_INT_ST_S  1
/** SDIO_SLC_HOST_SLC1_TOHOST_BIT2_INT_ST : RO; bitpos: [2]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT2_INT_ST    (BIT(2))
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT2_INT_ST_M  (SDIO_SLC_HOST_SLC1_TOHOST_BIT2_INT_ST_V << SDIO_SLC_HOST_SLC1_TOHOST_BIT2_INT_ST_S)
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT2_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT2_INT_ST_S  2
/** SDIO_SLC_HOST_SLC1_TOHOST_BIT3_INT_ST : RO; bitpos: [3]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT3_INT_ST    (BIT(3))
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT3_INT_ST_M  (SDIO_SLC_HOST_SLC1_TOHOST_BIT3_INT_ST_V << SDIO_SLC_HOST_SLC1_TOHOST_BIT3_INT_ST_S)
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT3_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT3_INT_ST_S  3
/** SDIO_SLC_HOST_SLC1_TOHOST_BIT4_INT_ST : RO; bitpos: [4]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT4_INT_ST    (BIT(4))
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT4_INT_ST_M  (SDIO_SLC_HOST_SLC1_TOHOST_BIT4_INT_ST_V << SDIO_SLC_HOST_SLC1_TOHOST_BIT4_INT_ST_S)
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT4_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT4_INT_ST_S  4
/** SDIO_SLC_HOST_SLC1_TOHOST_BIT5_INT_ST : RO; bitpos: [5]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT5_INT_ST    (BIT(5))
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT5_INT_ST_M  (SDIO_SLC_HOST_SLC1_TOHOST_BIT5_INT_ST_V << SDIO_SLC_HOST_SLC1_TOHOST_BIT5_INT_ST_S)
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT5_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT5_INT_ST_S  5
/** SDIO_SLC_HOST_SLC1_TOHOST_BIT6_INT_ST : RO; bitpos: [6]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT6_INT_ST    (BIT(6))
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT6_INT_ST_M  (SDIO_SLC_HOST_SLC1_TOHOST_BIT6_INT_ST_V << SDIO_SLC_HOST_SLC1_TOHOST_BIT6_INT_ST_S)
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT6_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT6_INT_ST_S  6
/** SDIO_SLC_HOST_SLC1_TOHOST_BIT7_INT_ST : RO; bitpos: [7]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT7_INT_ST    (BIT(7))
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT7_INT_ST_M  (SDIO_SLC_HOST_SLC1_TOHOST_BIT7_INT_ST_V << SDIO_SLC_HOST_SLC1_TOHOST_BIT7_INT_ST_S)
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT7_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT7_INT_ST_S  7
/** SDIO_SLC_HOST_SLC1_TOKEN0_1TO0_INT_ST : RO; bitpos: [8]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOKEN0_1TO0_INT_ST    (BIT(8))
#define SDIO_SLC_HOST_SLC1_TOKEN0_1TO0_INT_ST_M  (SDIO_SLC_HOST_SLC1_TOKEN0_1TO0_INT_ST_V << SDIO_SLC_HOST_SLC1_TOKEN0_1TO0_INT_ST_S)
#define SDIO_SLC_HOST_SLC1_TOKEN0_1TO0_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOKEN0_1TO0_INT_ST_S  8
/** SDIO_SLC_HOST_SLC1_TOKEN1_1TO0_INT_ST : RO; bitpos: [9]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOKEN1_1TO0_INT_ST    (BIT(9))
#define SDIO_SLC_HOST_SLC1_TOKEN1_1TO0_INT_ST_M  (SDIO_SLC_HOST_SLC1_TOKEN1_1TO0_INT_ST_V << SDIO_SLC_HOST_SLC1_TOKEN1_1TO0_INT_ST_S)
#define SDIO_SLC_HOST_SLC1_TOKEN1_1TO0_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOKEN1_1TO0_INT_ST_S  9
/** SDIO_SLC_HOST_SLC1_TOKEN0_0TO1_INT_ST : RO; bitpos: [10]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOKEN0_0TO1_INT_ST    (BIT(10))
#define SDIO_SLC_HOST_SLC1_TOKEN0_0TO1_INT_ST_M  (SDIO_SLC_HOST_SLC1_TOKEN0_0TO1_INT_ST_V << SDIO_SLC_HOST_SLC1_TOKEN0_0TO1_INT_ST_S)
#define SDIO_SLC_HOST_SLC1_TOKEN0_0TO1_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOKEN0_0TO1_INT_ST_S  10
/** SDIO_SLC_HOST_SLC1_TOKEN1_0TO1_INT_ST : RO; bitpos: [11]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOKEN1_0TO1_INT_ST    (BIT(11))
#define SDIO_SLC_HOST_SLC1_TOKEN1_0TO1_INT_ST_M  (SDIO_SLC_HOST_SLC1_TOKEN1_0TO1_INT_ST_V << SDIO_SLC_HOST_SLC1_TOKEN1_0TO1_INT_ST_S)
#define SDIO_SLC_HOST_SLC1_TOKEN1_0TO1_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOKEN1_0TO1_INT_ST_S  11
/** SDIO_SLC_HOST_SLC1HOST_RX_SOF_INT_ST : RO; bitpos: [12]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1HOST_RX_SOF_INT_ST    (BIT(12))
#define SDIO_SLC_HOST_SLC1HOST_RX_SOF_INT_ST_M  (SDIO_SLC_HOST_SLC1HOST_RX_SOF_INT_ST_V << SDIO_SLC_HOST_SLC1HOST_RX_SOF_INT_ST_S)
#define SDIO_SLC_HOST_SLC1HOST_RX_SOF_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC1HOST_RX_SOF_INT_ST_S  12
/** SDIO_SLC_HOST_SLC1HOST_RX_EOF_INT_ST : RO; bitpos: [13]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1HOST_RX_EOF_INT_ST    (BIT(13))
#define SDIO_SLC_HOST_SLC1HOST_RX_EOF_INT_ST_M  (SDIO_SLC_HOST_SLC1HOST_RX_EOF_INT_ST_V << SDIO_SLC_HOST_SLC1HOST_RX_EOF_INT_ST_S)
#define SDIO_SLC_HOST_SLC1HOST_RX_EOF_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC1HOST_RX_EOF_INT_ST_S  13
/** SDIO_SLC_HOST_SLC1HOST_RX_START_INT_ST : RO; bitpos: [14]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1HOST_RX_START_INT_ST    (BIT(14))
#define SDIO_SLC_HOST_SLC1HOST_RX_START_INT_ST_M  (SDIO_SLC_HOST_SLC1HOST_RX_START_INT_ST_V << SDIO_SLC_HOST_SLC1HOST_RX_START_INT_ST_S)
#define SDIO_SLC_HOST_SLC1HOST_RX_START_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC1HOST_RX_START_INT_ST_S  14
/** SDIO_SLC_HOST_SLC1HOST_TX_START_INT_ST : RO; bitpos: [15]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1HOST_TX_START_INT_ST    (BIT(15))
#define SDIO_SLC_HOST_SLC1HOST_TX_START_INT_ST_M  (SDIO_SLC_HOST_SLC1HOST_TX_START_INT_ST_V << SDIO_SLC_HOST_SLC1HOST_TX_START_INT_ST_S)
#define SDIO_SLC_HOST_SLC1HOST_TX_START_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC1HOST_TX_START_INT_ST_S  15
/** SDIO_SLC_HOST_SLC1_RX_UDF_INT_ST : RO; bitpos: [16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_RX_UDF_INT_ST    (BIT(16))
#define SDIO_SLC_HOST_SLC1_RX_UDF_INT_ST_M  (SDIO_SLC_HOST_SLC1_RX_UDF_INT_ST_V << SDIO_SLC_HOST_SLC1_RX_UDF_INT_ST_S)
#define SDIO_SLC_HOST_SLC1_RX_UDF_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_RX_UDF_INT_ST_S  16
/** SDIO_SLC_HOST_SLC1_TX_OVF_INT_ST : RO; bitpos: [17]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TX_OVF_INT_ST    (BIT(17))
#define SDIO_SLC_HOST_SLC1_TX_OVF_INT_ST_M  (SDIO_SLC_HOST_SLC1_TX_OVF_INT_ST_V << SDIO_SLC_HOST_SLC1_TX_OVF_INT_ST_S)
#define SDIO_SLC_HOST_SLC1_TX_OVF_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TX_OVF_INT_ST_S  17
/** SDIO_SLC_HOST_SLC1_RX_PF_VALID_INT_ST : RO; bitpos: [18]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_RX_PF_VALID_INT_ST    (BIT(18))
#define SDIO_SLC_HOST_SLC1_RX_PF_VALID_INT_ST_M  (SDIO_SLC_HOST_SLC1_RX_PF_VALID_INT_ST_V << SDIO_SLC_HOST_SLC1_RX_PF_VALID_INT_ST_S)
#define SDIO_SLC_HOST_SLC1_RX_PF_VALID_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_RX_PF_VALID_INT_ST_S  18
/** SDIO_SLC_HOST_SLC1_EXT_BIT0_INT_ST : RO; bitpos: [19]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_EXT_BIT0_INT_ST    (BIT(19))
#define SDIO_SLC_HOST_SLC1_EXT_BIT0_INT_ST_M  (SDIO_SLC_HOST_SLC1_EXT_BIT0_INT_ST_V << SDIO_SLC_HOST_SLC1_EXT_BIT0_INT_ST_S)
#define SDIO_SLC_HOST_SLC1_EXT_BIT0_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_EXT_BIT0_INT_ST_S  19
/** SDIO_SLC_HOST_SLC1_EXT_BIT1_INT_ST : RO; bitpos: [20]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_EXT_BIT1_INT_ST    (BIT(20))
#define SDIO_SLC_HOST_SLC1_EXT_BIT1_INT_ST_M  (SDIO_SLC_HOST_SLC1_EXT_BIT1_INT_ST_V << SDIO_SLC_HOST_SLC1_EXT_BIT1_INT_ST_S)
#define SDIO_SLC_HOST_SLC1_EXT_BIT1_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_EXT_BIT1_INT_ST_S  20
/** SDIO_SLC_HOST_SLC1_EXT_BIT2_INT_ST : RO; bitpos: [21]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_EXT_BIT2_INT_ST    (BIT(21))
#define SDIO_SLC_HOST_SLC1_EXT_BIT2_INT_ST_M  (SDIO_SLC_HOST_SLC1_EXT_BIT2_INT_ST_V << SDIO_SLC_HOST_SLC1_EXT_BIT2_INT_ST_S)
#define SDIO_SLC_HOST_SLC1_EXT_BIT2_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_EXT_BIT2_INT_ST_S  21
/** SDIO_SLC_HOST_SLC1_EXT_BIT3_INT_ST : RO; bitpos: [22]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_EXT_BIT3_INT_ST    (BIT(22))
#define SDIO_SLC_HOST_SLC1_EXT_BIT3_INT_ST_M  (SDIO_SLC_HOST_SLC1_EXT_BIT3_INT_ST_V << SDIO_SLC_HOST_SLC1_EXT_BIT3_INT_ST_S)
#define SDIO_SLC_HOST_SLC1_EXT_BIT3_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_EXT_BIT3_INT_ST_S  22
/** SDIO_SLC_HOST_SLC1_WIFI_RX_NEW_PACKET_INT_ST : RO; bitpos: [23]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_WIFI_RX_NEW_PACKET_INT_ST    (BIT(23))
#define SDIO_SLC_HOST_SLC1_WIFI_RX_NEW_PACKET_INT_ST_M  (SDIO_SLC_HOST_SLC1_WIFI_RX_NEW_PACKET_INT_ST_V << SDIO_SLC_HOST_SLC1_WIFI_RX_NEW_PACKET_INT_ST_S)
#define SDIO_SLC_HOST_SLC1_WIFI_RX_NEW_PACKET_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_WIFI_RX_NEW_PACKET_INT_ST_S  23
/** SDIO_SLC_HOST_SLC1_HOST_RD_RETRY_INT_ST : RO; bitpos: [24]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_HOST_RD_RETRY_INT_ST    (BIT(24))
#define SDIO_SLC_HOST_SLC1_HOST_RD_RETRY_INT_ST_M  (SDIO_SLC_HOST_SLC1_HOST_RD_RETRY_INT_ST_V << SDIO_SLC_HOST_SLC1_HOST_RD_RETRY_INT_ST_S)
#define SDIO_SLC_HOST_SLC1_HOST_RD_RETRY_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_HOST_RD_RETRY_INT_ST_S  24
/** SDIO_SLC_HOST_SLC1_BT_RX_NEW_PACKET_INT_ST : RO; bitpos: [25]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_BT_RX_NEW_PACKET_INT_ST    (BIT(25))
#define SDIO_SLC_HOST_SLC1_BT_RX_NEW_PACKET_INT_ST_M  (SDIO_SLC_HOST_SLC1_BT_RX_NEW_PACKET_INT_ST_V << SDIO_SLC_HOST_SLC1_BT_RX_NEW_PACKET_INT_ST_S)
#define SDIO_SLC_HOST_SLC1_BT_RX_NEW_PACKET_INT_ST_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_BT_RX_NEW_PACKET_INT_ST_S  25

/** SDIO_SLC_HOST_PKT_LEN_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_PKT_LEN_REG (DR_REG_SLCHOST_BASE + 0x60)
/** SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN : RO; bitpos: [19:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN    0x000FFFFFU
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN_M  (SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN_V << SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN_S)
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN_V  0x000FFFFFU
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN_S  0
/** SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN_CHECK : RO; bitpos: [31:20]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN_CHECK    0x00000FFFU
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN_CHECK_M  (SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN_CHECK_V << SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN_CHECK_S)
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN_CHECK_V  0x00000FFFU
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN_CHECK_S  20

/** SDIO_SLC_HOST_STATE_W0_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_STATE_W0_REG (DR_REG_SLCHOST_BASE + 0x64)
/** SDIO_SLC_HOST_SLCHOST_STATE0 : RO; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_STATE0    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_STATE0_M  (SDIO_SLC_HOST_SLCHOST_STATE0_V << SDIO_SLC_HOST_SLCHOST_STATE0_S)
#define SDIO_SLC_HOST_SLCHOST_STATE0_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_STATE0_S  0
/** SDIO_SLC_HOST_SLCHOST_STATE1 : RO; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_STATE1    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_STATE1_M  (SDIO_SLC_HOST_SLCHOST_STATE1_V << SDIO_SLC_HOST_SLCHOST_STATE1_S)
#define SDIO_SLC_HOST_SLCHOST_STATE1_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_STATE1_S  8
/** SDIO_SLC_HOST_SLCHOST_STATE2 : RO; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_STATE2    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_STATE2_M  (SDIO_SLC_HOST_SLCHOST_STATE2_V << SDIO_SLC_HOST_SLCHOST_STATE2_S)
#define SDIO_SLC_HOST_SLCHOST_STATE2_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_STATE2_S  16
/** SDIO_SLC_HOST_SLCHOST_STATE3 : RO; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_STATE3    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_STATE3_M  (SDIO_SLC_HOST_SLCHOST_STATE3_V << SDIO_SLC_HOST_SLCHOST_STATE3_S)
#define SDIO_SLC_HOST_SLCHOST_STATE3_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_STATE3_S  24

/** SDIO_SLC_HOST_STATE_W1_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_STATE_W1_REG (DR_REG_SLCHOST_BASE + 0x68)
/** SDIO_SLC_HOST_SLCHOST_STATE4 : RO; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_STATE4    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_STATE4_M  (SDIO_SLC_HOST_SLCHOST_STATE4_V << SDIO_SLC_HOST_SLCHOST_STATE4_S)
#define SDIO_SLC_HOST_SLCHOST_STATE4_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_STATE4_S  0
/** SDIO_SLC_HOST_SLCHOST_STATE5 : RO; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_STATE5    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_STATE5_M  (SDIO_SLC_HOST_SLCHOST_STATE5_V << SDIO_SLC_HOST_SLCHOST_STATE5_S)
#define SDIO_SLC_HOST_SLCHOST_STATE5_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_STATE5_S  8
/** SDIO_SLC_HOST_SLCHOST_STATE6 : RO; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_STATE6    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_STATE6_M  (SDIO_SLC_HOST_SLCHOST_STATE6_V << SDIO_SLC_HOST_SLCHOST_STATE6_S)
#define SDIO_SLC_HOST_SLCHOST_STATE6_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_STATE6_S  16
/** SDIO_SLC_HOST_SLCHOST_STATE7 : RO; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_STATE7    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_STATE7_M  (SDIO_SLC_HOST_SLCHOST_STATE7_V << SDIO_SLC_HOST_SLCHOST_STATE7_S)
#define SDIO_SLC_HOST_SLCHOST_STATE7_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_STATE7_S  24

/** SDIO_SLC_HOST_CONF_W0_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_CONF_W0_REG (DR_REG_SLCHOST_BASE + 0x6c)
/** SDIO_SLC_HOST_SLCHOST_CONF0 : R/W; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF0    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF0_M  (SDIO_SLC_HOST_SLCHOST_CONF0_V << SDIO_SLC_HOST_SLCHOST_CONF0_S)
#define SDIO_SLC_HOST_SLCHOST_CONF0_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF0_S  0
/** SDIO_SLC_HOST_SLCHOST_CONF1 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF1    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF1_M  (SDIO_SLC_HOST_SLCHOST_CONF1_V << SDIO_SLC_HOST_SLCHOST_CONF1_S)
#define SDIO_SLC_HOST_SLCHOST_CONF1_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF1_S  8
/** SDIO_SLC_HOST_SLCHOST_CONF2 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF2    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF2_M  (SDIO_SLC_HOST_SLCHOST_CONF2_V << SDIO_SLC_HOST_SLCHOST_CONF2_S)
#define SDIO_SLC_HOST_SLCHOST_CONF2_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF2_S  16
/** SDIO_SLC_HOST_SLCHOST_CONF3 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF3    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF3_M  (SDIO_SLC_HOST_SLCHOST_CONF3_V << SDIO_SLC_HOST_SLCHOST_CONF3_S)
#define SDIO_SLC_HOST_SLCHOST_CONF3_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF3_S  24

