espressif/esp-idf/components/soc/esp32c5/register/soc/sdio_slc_host_reg.h
/** SDIO_SLC_HOST_WIN_CMD_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_WIN_CMD_REG (DR_REG_SLCHOST_BASE + 0x84)
/** SDIO_SLC_HOST_SLCHOST_WIN_CMD : R/W; bitpos: [15:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_WIN_CMD    0x0000FFFFU
#define SDIO_SLC_HOST_SLCHOST_WIN_CMD_M  (SDIO_SLC_HOST_SLCHOST_WIN_CMD_V << SDIO_SLC_HOST_SLCHOST_WIN_CMD_S)
#define SDIO_SLC_HOST_SLCHOST_WIN_CMD_V  0x0000FFFFU
#define SDIO_SLC_HOST_SLCHOST_WIN_CMD_S  0

/** SDIO_SLC_HOST_CONF_W6_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_CONF_W6_REG (DR_REG_SLCHOST_BASE + 0x88)
/** SDIO_SLC_HOST_SLCHOST_CONF24 : R/W; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF24    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF24_M  (SDIO_SLC_HOST_SLCHOST_CONF24_V << SDIO_SLC_HOST_SLCHOST_CONF24_S)
#define SDIO_SLC_HOST_SLCHOST_CONF24_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF24_S  0
/** SDIO_SLC_HOST_SLCHOST_CONF25 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF25    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF25_M  (SDIO_SLC_HOST_SLCHOST_CONF25_V << SDIO_SLC_HOST_SLCHOST_CONF25_S)
#define SDIO_SLC_HOST_SLCHOST_CONF25_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF25_S  8
/** SDIO_SLC_HOST_SLCHOST_CONF26 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF26    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF26_M  (SDIO_SLC_HOST_SLCHOST_CONF26_V << SDIO_SLC_HOST_SLCHOST_CONF26_S)
#define SDIO_SLC_HOST_SLCHOST_CONF26_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF26_S  16
/** SDIO_SLC_HOST_SLCHOST_CONF27 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF27    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF27_M  (SDIO_SLC_HOST_SLCHOST_CONF27_V << SDIO_SLC_HOST_SLCHOST_CONF27_S)
#define SDIO_SLC_HOST_SLCHOST_CONF27_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF27_S  24

/** SDIO_SLC_HOST_CONF_W7_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_CONF_W7_REG (DR_REG_SLCHOST_BASE + 0x8c)
/** SDIO_SLC_HOST_SLCHOST_CONF28 : R/W; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF28    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF28_M  (SDIO_SLC_HOST_SLCHOST_CONF28_V << SDIO_SLC_HOST_SLCHOST_CONF28_S)
#define SDIO_SLC_HOST_SLCHOST_CONF28_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF28_S  0
/** SDIO_SLC_HOST_SLCHOST_CONF29 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF29    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF29_M  (SDIO_SLC_HOST_SLCHOST_CONF29_V << SDIO_SLC_HOST_SLCHOST_CONF29_S)
#define SDIO_SLC_HOST_SLCHOST_CONF29_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF29_S  8
/** SDIO_SLC_HOST_SLCHOST_CONF30 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF30    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF30_M  (SDIO_SLC_HOST_SLCHOST_CONF30_V << SDIO_SLC_HOST_SLCHOST_CONF30_S)
#define SDIO_SLC_HOST_SLCHOST_CONF30_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF30_S  16
/** SDIO_SLC_HOST_SLCHOST_CONF31 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF31    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF31_M  (SDIO_SLC_HOST_SLCHOST_CONF31_V << SDIO_SLC_HOST_SLCHOST_CONF31_S)
#define SDIO_SLC_HOST_SLCHOST_CONF31_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF31_S  24

/** SDIO_SLC_HOST_PKT_LEN0_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_PKT_LEN0_REG (DR_REG_SLCHOST_BASE + 0x90)
/** SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN0 : RO; bitpos: [19:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN0    0x000FFFFFU
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN0_M  (SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN0_V << SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN0_S)
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN0_V  0x000FFFFFU
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN0_S  0
/** SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN0_CHECK : RO; bitpos: [31:20]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN0_CHECK    0x00000FFFU
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN0_CHECK_M  (SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN0_CHECK_V << SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN0_CHECK_S)
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN0_CHECK_V  0x00000FFFU
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN0_CHECK_S  20

/** SDIO_SLC_HOST_PKT_LEN1_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_PKT_LEN1_REG (DR_REG_SLCHOST_BASE + 0x94)
/** SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN1 : RO; bitpos: [19:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN1    0x000FFFFFU
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN1_M  (SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN1_V << SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN1_S)
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN1_V  0x000FFFFFU
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN1_S  0
/** SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN1_CHECK : RO; bitpos: [31:20]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN1_CHECK    0x00000FFFU
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN1_CHECK_M  (SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN1_CHECK_V << SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN1_CHECK_S)
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN1_CHECK_V  0x00000FFFU
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN1_CHECK_S  20

/** SDIO_SLC_HOST_PKT_LEN2_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_PKT_LEN2_REG (DR_REG_SLCHOST_BASE + 0x98)
/** SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN2 : RO; bitpos: [19:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN2    0x000FFFFFU
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN2_M  (SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN2_V << SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN2_S)
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN2_V  0x000FFFFFU
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN2_S  0
/** SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN2_CHECK : RO; bitpos: [31:20]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN2_CHECK    0x00000FFFU
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN2_CHECK_M  (SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN2_CHECK_V << SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN2_CHECK_S)
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN2_CHECK_V  0x00000FFFU
#define SDIO_SLC_HOST_HOSTSLCHOST_SLC0_LEN2_CHECK_S  20

