espressif/esp-idf/components/soc/esp32c5/register/soc/sdio_slc_host_reg.h
/** SDIO_SLC_HOST_CONF_W8_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_CONF_W8_REG (DR_REG_SLCHOST_BASE + 0x9c)
/** SDIO_SLC_HOST_SLCHOST_CONF32 : R/W; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF32    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF32_M  (SDIO_SLC_HOST_SLCHOST_CONF32_V << SDIO_SLC_HOST_SLCHOST_CONF32_S)
#define SDIO_SLC_HOST_SLCHOST_CONF32_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF32_S  0
/** SDIO_SLC_HOST_SLCHOST_CONF33 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF33    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF33_M  (SDIO_SLC_HOST_SLCHOST_CONF33_V << SDIO_SLC_HOST_SLCHOST_CONF33_S)
#define SDIO_SLC_HOST_SLCHOST_CONF33_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF33_S  8
/** SDIO_SLC_HOST_SLCHOST_CONF34 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF34    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF34_M  (SDIO_SLC_HOST_SLCHOST_CONF34_V << SDIO_SLC_HOST_SLCHOST_CONF34_S)
#define SDIO_SLC_HOST_SLCHOST_CONF34_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF34_S  16
/** SDIO_SLC_HOST_SLCHOST_CONF35 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF35    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF35_M  (SDIO_SLC_HOST_SLCHOST_CONF35_V << SDIO_SLC_HOST_SLCHOST_CONF35_S)
#define SDIO_SLC_HOST_SLCHOST_CONF35_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF35_S  24

/** SDIO_SLC_HOST_CONF_W9_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_CONF_W9_REG (DR_REG_SLCHOST_BASE + 0xa0)
/** SDIO_SLC_HOST_SLCHOST_CONF36 : R/W; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF36    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF36_M  (SDIO_SLC_HOST_SLCHOST_CONF36_V << SDIO_SLC_HOST_SLCHOST_CONF36_S)
#define SDIO_SLC_HOST_SLCHOST_CONF36_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF36_S  0
/** SDIO_SLC_HOST_SLCHOST_CONF37 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF37    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF37_M  (SDIO_SLC_HOST_SLCHOST_CONF37_V << SDIO_SLC_HOST_SLCHOST_CONF37_S)
#define SDIO_SLC_HOST_SLCHOST_CONF37_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF37_S  8
/** SDIO_SLC_HOST_SLCHOST_CONF38 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF38    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF38_M  (SDIO_SLC_HOST_SLCHOST_CONF38_V << SDIO_SLC_HOST_SLCHOST_CONF38_S)
#define SDIO_SLC_HOST_SLCHOST_CONF38_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF38_S  16
/** SDIO_SLC_HOST_SLCHOST_CONF39 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF39    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF39_M  (SDIO_SLC_HOST_SLCHOST_CONF39_V << SDIO_SLC_HOST_SLCHOST_CONF39_S)
#define SDIO_SLC_HOST_SLCHOST_CONF39_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF39_S  24

/** SDIO_SLC_HOST_CONF_W10_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_CONF_W10_REG (DR_REG_SLCHOST_BASE + 0xa4)
/** SDIO_SLC_HOST_SLCHOST_CONF40 : R/W; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF40    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF40_M  (SDIO_SLC_HOST_SLCHOST_CONF40_V << SDIO_SLC_HOST_SLCHOST_CONF40_S)
#define SDIO_SLC_HOST_SLCHOST_CONF40_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF40_S  0
/** SDIO_SLC_HOST_SLCHOST_CONF41 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF41    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF41_M  (SDIO_SLC_HOST_SLCHOST_CONF41_V << SDIO_SLC_HOST_SLCHOST_CONF41_S)
#define SDIO_SLC_HOST_SLCHOST_CONF41_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF41_S  8
/** SDIO_SLC_HOST_SLCHOST_CONF42 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF42    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF42_M  (SDIO_SLC_HOST_SLCHOST_CONF42_V << SDIO_SLC_HOST_SLCHOST_CONF42_S)
#define SDIO_SLC_HOST_SLCHOST_CONF42_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF42_S  16
/** SDIO_SLC_HOST_SLCHOST_CONF43 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF43    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF43_M  (SDIO_SLC_HOST_SLCHOST_CONF43_V << SDIO_SLC_HOST_SLCHOST_CONF43_S)
#define SDIO_SLC_HOST_SLCHOST_CONF43_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF43_S  24

/** SDIO_SLC_HOST_CONF_W11_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_CONF_W11_REG (DR_REG_SLCHOST_BASE + 0xa8)
/** SDIO_SLC_HOST_SLCHOST_CONF44 : R/W; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF44    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF44_M  (SDIO_SLC_HOST_SLCHOST_CONF44_V << SDIO_SLC_HOST_SLCHOST_CONF44_S)
#define SDIO_SLC_HOST_SLCHOST_CONF44_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF44_S  0
/** SDIO_SLC_HOST_SLCHOST_CONF45 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF45    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF45_M  (SDIO_SLC_HOST_SLCHOST_CONF45_V << SDIO_SLC_HOST_SLCHOST_CONF45_S)
#define SDIO_SLC_HOST_SLCHOST_CONF45_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF45_S  8
/** SDIO_SLC_HOST_SLCHOST_CONF46 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF46    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF46_M  (SDIO_SLC_HOST_SLCHOST_CONF46_V << SDIO_SLC_HOST_SLCHOST_CONF46_S)
#define SDIO_SLC_HOST_SLCHOST_CONF46_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF46_S  16
/** SDIO_SLC_HOST_SLCHOST_CONF47 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF47    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF47_M  (SDIO_SLC_HOST_SLCHOST_CONF47_V << SDIO_SLC_HOST_SLCHOST_CONF47_S)
#define SDIO_SLC_HOST_SLCHOST_CONF47_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF47_S  24

/** SDIO_SLC_HOST_CONF_W12_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_CONF_W12_REG (DR_REG_SLCHOST_BASE + 0xac)
/** SDIO_SLC_HOST_SLCHOST_CONF48 : R/W; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF48    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF48_M  (SDIO_SLC_HOST_SLCHOST_CONF48_V << SDIO_SLC_HOST_SLCHOST_CONF48_S)
#define SDIO_SLC_HOST_SLCHOST_CONF48_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF48_S  0
/** SDIO_SLC_HOST_SLCHOST_CONF49 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF49    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF49_M  (SDIO_SLC_HOST_SLCHOST_CONF49_V << SDIO_SLC_HOST_SLCHOST_CONF49_S)
#define SDIO_SLC_HOST_SLCHOST_CONF49_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF49_S  8
/** SDIO_SLC_HOST_SLCHOST_CONF50 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF50    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF50_M  (SDIO_SLC_HOST_SLCHOST_CONF50_V << SDIO_SLC_HOST_SLCHOST_CONF50_S)
#define SDIO_SLC_HOST_SLCHOST_CONF50_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF50_S  16
/** SDIO_SLC_HOST_SLCHOST_CONF51 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_CONF51    0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF51_M  (SDIO_SLC_HOST_SLCHOST_CONF51_V << SDIO_SLC_HOST_SLCHOST_CONF51_S)
#define SDIO_SLC_HOST_SLCHOST_CONF51_V  0x000000FFU
#define SDIO_SLC_HOST_SLCHOST_CONF51_S  24

