espressif/esp-idf/components/soc/esp32c5/register/soc/sdio_slc_host_reg.h
/** SDIO_SLC_HOST_SLC0HOST_INT_CLR_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0HOST_INT_CLR_REG (DR_REG_SLCHOST_BASE + 0xd4)
/** SDIO_SLC_HOST_SLC0_TOHOST_BIT0_INT_CLR : WT; bitpos: [0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT0_INT_CLR    (BIT(0))
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT0_INT_CLR_M  (SDIO_SLC_HOST_SLC0_TOHOST_BIT0_INT_CLR_V << SDIO_SLC_HOST_SLC0_TOHOST_BIT0_INT_CLR_S)
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT0_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT0_INT_CLR_S  0
/** SDIO_SLC_HOST_SLC0_TOHOST_BIT1_INT_CLR : WT; bitpos: [1]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT1_INT_CLR    (BIT(1))
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT1_INT_CLR_M  (SDIO_SLC_HOST_SLC0_TOHOST_BIT1_INT_CLR_V << SDIO_SLC_HOST_SLC0_TOHOST_BIT1_INT_CLR_S)
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT1_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT1_INT_CLR_S  1
/** SDIO_SLC_HOST_SLC0_TOHOST_BIT2_INT_CLR : WT; bitpos: [2]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT2_INT_CLR    (BIT(2))
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT2_INT_CLR_M  (SDIO_SLC_HOST_SLC0_TOHOST_BIT2_INT_CLR_V << SDIO_SLC_HOST_SLC0_TOHOST_BIT2_INT_CLR_S)
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT2_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT2_INT_CLR_S  2
/** SDIO_SLC_HOST_SLC0_TOHOST_BIT3_INT_CLR : WT; bitpos: [3]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT3_INT_CLR    (BIT(3))
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT3_INT_CLR_M  (SDIO_SLC_HOST_SLC0_TOHOST_BIT3_INT_CLR_V << SDIO_SLC_HOST_SLC0_TOHOST_BIT3_INT_CLR_S)
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT3_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT3_INT_CLR_S  3
/** SDIO_SLC_HOST_SLC0_TOHOST_BIT4_INT_CLR : WT; bitpos: [4]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT4_INT_CLR    (BIT(4))
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT4_INT_CLR_M  (SDIO_SLC_HOST_SLC0_TOHOST_BIT4_INT_CLR_V << SDIO_SLC_HOST_SLC0_TOHOST_BIT4_INT_CLR_S)
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT4_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT4_INT_CLR_S  4
/** SDIO_SLC_HOST_SLC0_TOHOST_BIT5_INT_CLR : WT; bitpos: [5]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT5_INT_CLR    (BIT(5))
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT5_INT_CLR_M  (SDIO_SLC_HOST_SLC0_TOHOST_BIT5_INT_CLR_V << SDIO_SLC_HOST_SLC0_TOHOST_BIT5_INT_CLR_S)
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT5_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT5_INT_CLR_S  5
/** SDIO_SLC_HOST_SLC0_TOHOST_BIT6_INT_CLR : WT; bitpos: [6]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT6_INT_CLR    (BIT(6))
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT6_INT_CLR_M  (SDIO_SLC_HOST_SLC0_TOHOST_BIT6_INT_CLR_V << SDIO_SLC_HOST_SLC0_TOHOST_BIT6_INT_CLR_S)
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT6_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT6_INT_CLR_S  6
/** SDIO_SLC_HOST_SLC0_TOHOST_BIT7_INT_CLR : WT; bitpos: [7]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT7_INT_CLR    (BIT(7))
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT7_INT_CLR_M  (SDIO_SLC_HOST_SLC0_TOHOST_BIT7_INT_CLR_V << SDIO_SLC_HOST_SLC0_TOHOST_BIT7_INT_CLR_S)
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT7_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_TOHOST_BIT7_INT_CLR_S  7
/** SDIO_SLC_HOST_SLC0_TOKEN0_1TO0_INT_CLR : WT; bitpos: [8]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_TOKEN0_1TO0_INT_CLR    (BIT(8))
#define SDIO_SLC_HOST_SLC0_TOKEN0_1TO0_INT_CLR_M  (SDIO_SLC_HOST_SLC0_TOKEN0_1TO0_INT_CLR_V << SDIO_SLC_HOST_SLC0_TOKEN0_1TO0_INT_CLR_S)
#define SDIO_SLC_HOST_SLC0_TOKEN0_1TO0_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_TOKEN0_1TO0_INT_CLR_S  8
/** SDIO_SLC_HOST_SLC0_TOKEN1_1TO0_INT_CLR : WT; bitpos: [9]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_TOKEN1_1TO0_INT_CLR    (BIT(9))
#define SDIO_SLC_HOST_SLC0_TOKEN1_1TO0_INT_CLR_M  (SDIO_SLC_HOST_SLC0_TOKEN1_1TO0_INT_CLR_V << SDIO_SLC_HOST_SLC0_TOKEN1_1TO0_INT_CLR_S)
#define SDIO_SLC_HOST_SLC0_TOKEN1_1TO0_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_TOKEN1_1TO0_INT_CLR_S  9
/** SDIO_SLC_HOST_SLC0_TOKEN0_0TO1_INT_CLR : WT; bitpos: [10]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_TOKEN0_0TO1_INT_CLR    (BIT(10))
#define SDIO_SLC_HOST_SLC0_TOKEN0_0TO1_INT_CLR_M  (SDIO_SLC_HOST_SLC0_TOKEN0_0TO1_INT_CLR_V << SDIO_SLC_HOST_SLC0_TOKEN0_0TO1_INT_CLR_S)
#define SDIO_SLC_HOST_SLC0_TOKEN0_0TO1_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_TOKEN0_0TO1_INT_CLR_S  10
/** SDIO_SLC_HOST_SLC0_TOKEN1_0TO1_INT_CLR : WT; bitpos: [11]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_TOKEN1_0TO1_INT_CLR    (BIT(11))
#define SDIO_SLC_HOST_SLC0_TOKEN1_0TO1_INT_CLR_M  (SDIO_SLC_HOST_SLC0_TOKEN1_0TO1_INT_CLR_V << SDIO_SLC_HOST_SLC0_TOKEN1_0TO1_INT_CLR_S)
#define SDIO_SLC_HOST_SLC0_TOKEN1_0TO1_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_TOKEN1_0TO1_INT_CLR_S  11
/** SDIO_SLC_HOST_SLC0HOST_RX_SOF_INT_CLR : WT; bitpos: [12]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0HOST_RX_SOF_INT_CLR    (BIT(12))
#define SDIO_SLC_HOST_SLC0HOST_RX_SOF_INT_CLR_M  (SDIO_SLC_HOST_SLC0HOST_RX_SOF_INT_CLR_V << SDIO_SLC_HOST_SLC0HOST_RX_SOF_INT_CLR_S)
#define SDIO_SLC_HOST_SLC0HOST_RX_SOF_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC0HOST_RX_SOF_INT_CLR_S  12
/** SDIO_SLC_HOST_SLC0HOST_RX_EOF_INT_CLR : WT; bitpos: [13]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0HOST_RX_EOF_INT_CLR    (BIT(13))
#define SDIO_SLC_HOST_SLC0HOST_RX_EOF_INT_CLR_M  (SDIO_SLC_HOST_SLC0HOST_RX_EOF_INT_CLR_V << SDIO_SLC_HOST_SLC0HOST_RX_EOF_INT_CLR_S)
#define SDIO_SLC_HOST_SLC0HOST_RX_EOF_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC0HOST_RX_EOF_INT_CLR_S  13
/** SDIO_SLC_HOST_SLC0HOST_RX_START_INT_CLR : WT; bitpos: [14]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0HOST_RX_START_INT_CLR    (BIT(14))
#define SDIO_SLC_HOST_SLC0HOST_RX_START_INT_CLR_M  (SDIO_SLC_HOST_SLC0HOST_RX_START_INT_CLR_V << SDIO_SLC_HOST_SLC0HOST_RX_START_INT_CLR_S)
#define SDIO_SLC_HOST_SLC0HOST_RX_START_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC0HOST_RX_START_INT_CLR_S  14
/** SDIO_SLC_HOST_SLC0HOST_TX_START_INT_CLR : WT; bitpos: [15]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0HOST_TX_START_INT_CLR    (BIT(15))
#define SDIO_SLC_HOST_SLC0HOST_TX_START_INT_CLR_M  (SDIO_SLC_HOST_SLC0HOST_TX_START_INT_CLR_V << SDIO_SLC_HOST_SLC0HOST_TX_START_INT_CLR_S)
#define SDIO_SLC_HOST_SLC0HOST_TX_START_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC0HOST_TX_START_INT_CLR_S  15
/** SDIO_SLC_HOST_SLC0_RX_UDF_INT_CLR : WT; bitpos: [16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_RX_UDF_INT_CLR    (BIT(16))
#define SDIO_SLC_HOST_SLC0_RX_UDF_INT_CLR_M  (SDIO_SLC_HOST_SLC0_RX_UDF_INT_CLR_V << SDIO_SLC_HOST_SLC0_RX_UDF_INT_CLR_S)
#define SDIO_SLC_HOST_SLC0_RX_UDF_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_RX_UDF_INT_CLR_S  16
/** SDIO_SLC_HOST_SLC0_TX_OVF_INT_CLR : WT; bitpos: [17]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_TX_OVF_INT_CLR    (BIT(17))
#define SDIO_SLC_HOST_SLC0_TX_OVF_INT_CLR_M  (SDIO_SLC_HOST_SLC0_TX_OVF_INT_CLR_V << SDIO_SLC_HOST_SLC0_TX_OVF_INT_CLR_S)
#define SDIO_SLC_HOST_SLC0_TX_OVF_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_TX_OVF_INT_CLR_S  17
/** SDIO_SLC_HOST_SLC0_RX_PF_VALID_INT_CLR : WT; bitpos: [18]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_RX_PF_VALID_INT_CLR    (BIT(18))
#define SDIO_SLC_HOST_SLC0_RX_PF_VALID_INT_CLR_M  (SDIO_SLC_HOST_SLC0_RX_PF_VALID_INT_CLR_V << SDIO_SLC_HOST_SLC0_RX_PF_VALID_INT_CLR_S)
#define SDIO_SLC_HOST_SLC0_RX_PF_VALID_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_RX_PF_VALID_INT_CLR_S  18
/** SDIO_SLC_HOST_SLC0_EXT_BIT0_INT_CLR : WT; bitpos: [19]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_EXT_BIT0_INT_CLR    (BIT(19))
#define SDIO_SLC_HOST_SLC0_EXT_BIT0_INT_CLR_M  (SDIO_SLC_HOST_SLC0_EXT_BIT0_INT_CLR_V << SDIO_SLC_HOST_SLC0_EXT_BIT0_INT_CLR_S)
#define SDIO_SLC_HOST_SLC0_EXT_BIT0_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_EXT_BIT0_INT_CLR_S  19
/** SDIO_SLC_HOST_SLC0_EXT_BIT1_INT_CLR : WT; bitpos: [20]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_EXT_BIT1_INT_CLR    (BIT(20))
#define SDIO_SLC_HOST_SLC0_EXT_BIT1_INT_CLR_M  (SDIO_SLC_HOST_SLC0_EXT_BIT1_INT_CLR_V << SDIO_SLC_HOST_SLC0_EXT_BIT1_INT_CLR_S)
#define SDIO_SLC_HOST_SLC0_EXT_BIT1_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_EXT_BIT1_INT_CLR_S  20
/** SDIO_SLC_HOST_SLC0_EXT_BIT2_INT_CLR : WT; bitpos: [21]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_EXT_BIT2_INT_CLR    (BIT(21))
#define SDIO_SLC_HOST_SLC0_EXT_BIT2_INT_CLR_M  (SDIO_SLC_HOST_SLC0_EXT_BIT2_INT_CLR_V << SDIO_SLC_HOST_SLC0_EXT_BIT2_INT_CLR_S)
#define SDIO_SLC_HOST_SLC0_EXT_BIT2_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_EXT_BIT2_INT_CLR_S  21
/** SDIO_SLC_HOST_SLC0_EXT_BIT3_INT_CLR : WT; bitpos: [22]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_EXT_BIT3_INT_CLR    (BIT(22))
#define SDIO_SLC_HOST_SLC0_EXT_BIT3_INT_CLR_M  (SDIO_SLC_HOST_SLC0_EXT_BIT3_INT_CLR_V << SDIO_SLC_HOST_SLC0_EXT_BIT3_INT_CLR_S)
#define SDIO_SLC_HOST_SLC0_EXT_BIT3_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_EXT_BIT3_INT_CLR_S  22
/** SDIO_SLC_HOST_SLC0_RX_NEW_PACKET_INT_CLR : WT; bitpos: [23]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_RX_NEW_PACKET_INT_CLR    (BIT(23))
#define SDIO_SLC_HOST_SLC0_RX_NEW_PACKET_INT_CLR_M  (SDIO_SLC_HOST_SLC0_RX_NEW_PACKET_INT_CLR_V << SDIO_SLC_HOST_SLC0_RX_NEW_PACKET_INT_CLR_S)
#define SDIO_SLC_HOST_SLC0_RX_NEW_PACKET_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_RX_NEW_PACKET_INT_CLR_S  23
/** SDIO_SLC_HOST_SLC0_HOST_RD_RETRY_INT_CLR : WT; bitpos: [24]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_HOST_RD_RETRY_INT_CLR    (BIT(24))
#define SDIO_SLC_HOST_SLC0_HOST_RD_RETRY_INT_CLR_M  (SDIO_SLC_HOST_SLC0_HOST_RD_RETRY_INT_CLR_V << SDIO_SLC_HOST_SLC0_HOST_RD_RETRY_INT_CLR_S)
#define SDIO_SLC_HOST_SLC0_HOST_RD_RETRY_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC0_HOST_RD_RETRY_INT_CLR_S  24
/** SDIO_SLC_HOST_GPIO_SDIO_INT_CLR : WT; bitpos: [25]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_GPIO_SDIO_INT_CLR    (BIT(25))
#define SDIO_SLC_HOST_GPIO_SDIO_INT_CLR_M  (SDIO_SLC_HOST_GPIO_SDIO_INT_CLR_V << SDIO_SLC_HOST_GPIO_SDIO_INT_CLR_S)
#define SDIO_SLC_HOST_GPIO_SDIO_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_GPIO_SDIO_INT_CLR_S  25

/** SDIO_SLC_HOST_SLC1HOST_INT_CLR_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1HOST_INT_CLR_REG (DR_REG_SLCHOST_BASE + 0xd8)
/** SDIO_SLC_HOST_SLC1_TOHOST_BIT0_INT_CLR : WT; bitpos: [0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT0_INT_CLR    (BIT(0))
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT0_INT_CLR_M  (SDIO_SLC_HOST_SLC1_TOHOST_BIT0_INT_CLR_V << SDIO_SLC_HOST_SLC1_TOHOST_BIT0_INT_CLR_S)
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT0_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT0_INT_CLR_S  0
/** SDIO_SLC_HOST_SLC1_TOHOST_BIT1_INT_CLR : WT; bitpos: [1]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT1_INT_CLR    (BIT(1))
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT1_INT_CLR_M  (SDIO_SLC_HOST_SLC1_TOHOST_BIT1_INT_CLR_V << SDIO_SLC_HOST_SLC1_TOHOST_BIT1_INT_CLR_S)
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT1_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT1_INT_CLR_S  1
/** SDIO_SLC_HOST_SLC1_TOHOST_BIT2_INT_CLR : WT; bitpos: [2]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT2_INT_CLR    (BIT(2))
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT2_INT_CLR_M  (SDIO_SLC_HOST_SLC1_TOHOST_BIT2_INT_CLR_V << SDIO_SLC_HOST_SLC1_TOHOST_BIT2_INT_CLR_S)
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT2_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT2_INT_CLR_S  2
/** SDIO_SLC_HOST_SLC1_TOHOST_BIT3_INT_CLR : WT; bitpos: [3]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT3_INT_CLR    (BIT(3))
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT3_INT_CLR_M  (SDIO_SLC_HOST_SLC1_TOHOST_BIT3_INT_CLR_V << SDIO_SLC_HOST_SLC1_TOHOST_BIT3_INT_CLR_S)
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT3_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT3_INT_CLR_S  3
/** SDIO_SLC_HOST_SLC1_TOHOST_BIT4_INT_CLR : WT; bitpos: [4]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT4_INT_CLR    (BIT(4))
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT4_INT_CLR_M  (SDIO_SLC_HOST_SLC1_TOHOST_BIT4_INT_CLR_V << SDIO_SLC_HOST_SLC1_TOHOST_BIT4_INT_CLR_S)
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT4_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT4_INT_CLR_S  4
/** SDIO_SLC_HOST_SLC1_TOHOST_BIT5_INT_CLR : WT; bitpos: [5]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT5_INT_CLR    (BIT(5))
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT5_INT_CLR_M  (SDIO_SLC_HOST_SLC1_TOHOST_BIT5_INT_CLR_V << SDIO_SLC_HOST_SLC1_TOHOST_BIT5_INT_CLR_S)
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT5_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT5_INT_CLR_S  5
/** SDIO_SLC_HOST_SLC1_TOHOST_BIT6_INT_CLR : WT; bitpos: [6]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT6_INT_CLR    (BIT(6))
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT6_INT_CLR_M  (SDIO_SLC_HOST_SLC1_TOHOST_BIT6_INT_CLR_V << SDIO_SLC_HOST_SLC1_TOHOST_BIT6_INT_CLR_S)
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT6_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT6_INT_CLR_S  6
/** SDIO_SLC_HOST_SLC1_TOHOST_BIT7_INT_CLR : WT; bitpos: [7]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT7_INT_CLR    (BIT(7))
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT7_INT_CLR_M  (SDIO_SLC_HOST_SLC1_TOHOST_BIT7_INT_CLR_V << SDIO_SLC_HOST_SLC1_TOHOST_BIT7_INT_CLR_S)
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT7_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOHOST_BIT7_INT_CLR_S  7
/** SDIO_SLC_HOST_SLC1_TOKEN0_1TO0_INT_CLR : WT; bitpos: [8]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOKEN0_1TO0_INT_CLR    (BIT(8))
#define SDIO_SLC_HOST_SLC1_TOKEN0_1TO0_INT_CLR_M  (SDIO_SLC_HOST_SLC1_TOKEN0_1TO0_INT_CLR_V << SDIO_SLC_HOST_SLC1_TOKEN0_1TO0_INT_CLR_S)
#define SDIO_SLC_HOST_SLC1_TOKEN0_1TO0_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOKEN0_1TO0_INT_CLR_S  8
/** SDIO_SLC_HOST_SLC1_TOKEN1_1TO0_INT_CLR : WT; bitpos: [9]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOKEN1_1TO0_INT_CLR    (BIT(9))
#define SDIO_SLC_HOST_SLC1_TOKEN1_1TO0_INT_CLR_M  (SDIO_SLC_HOST_SLC1_TOKEN1_1TO0_INT_CLR_V << SDIO_SLC_HOST_SLC1_TOKEN1_1TO0_INT_CLR_S)
#define SDIO_SLC_HOST_SLC1_TOKEN1_1TO0_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOKEN1_1TO0_INT_CLR_S  9
/** SDIO_SLC_HOST_SLC1_TOKEN0_0TO1_INT_CLR : WT; bitpos: [10]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOKEN0_0TO1_INT_CLR    (BIT(10))
#define SDIO_SLC_HOST_SLC1_TOKEN0_0TO1_INT_CLR_M  (SDIO_SLC_HOST_SLC1_TOKEN0_0TO1_INT_CLR_V << SDIO_SLC_HOST_SLC1_TOKEN0_0TO1_INT_CLR_S)
#define SDIO_SLC_HOST_SLC1_TOKEN0_0TO1_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOKEN0_0TO1_INT_CLR_S  10
/** SDIO_SLC_HOST_SLC1_TOKEN1_0TO1_INT_CLR : WT; bitpos: [11]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TOKEN1_0TO1_INT_CLR    (BIT(11))
#define SDIO_SLC_HOST_SLC1_TOKEN1_0TO1_INT_CLR_M  (SDIO_SLC_HOST_SLC1_TOKEN1_0TO1_INT_CLR_V << SDIO_SLC_HOST_SLC1_TOKEN1_0TO1_INT_CLR_S)
#define SDIO_SLC_HOST_SLC1_TOKEN1_0TO1_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TOKEN1_0TO1_INT_CLR_S  11
/** SDIO_SLC_HOST_SLC1HOST_RX_SOF_INT_CLR : WT; bitpos: [12]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1HOST_RX_SOF_INT_CLR    (BIT(12))
#define SDIO_SLC_HOST_SLC1HOST_RX_SOF_INT_CLR_M  (SDIO_SLC_HOST_SLC1HOST_RX_SOF_INT_CLR_V << SDIO_SLC_HOST_SLC1HOST_RX_SOF_INT_CLR_S)
#define SDIO_SLC_HOST_SLC1HOST_RX_SOF_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC1HOST_RX_SOF_INT_CLR_S  12
/** SDIO_SLC_HOST_SLC1HOST_RX_EOF_INT_CLR : WT; bitpos: [13]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1HOST_RX_EOF_INT_CLR    (BIT(13))
#define SDIO_SLC_HOST_SLC1HOST_RX_EOF_INT_CLR_M  (SDIO_SLC_HOST_SLC1HOST_RX_EOF_INT_CLR_V << SDIO_SLC_HOST_SLC1HOST_RX_EOF_INT_CLR_S)
#define SDIO_SLC_HOST_SLC1HOST_RX_EOF_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC1HOST_RX_EOF_INT_CLR_S  13
/** SDIO_SLC_HOST_SLC1HOST_RX_START_INT_CLR : WT; bitpos: [14]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1HOST_RX_START_INT_CLR    (BIT(14))
#define SDIO_SLC_HOST_SLC1HOST_RX_START_INT_CLR_M  (SDIO_SLC_HOST_SLC1HOST_RX_START_INT_CLR_V << SDIO_SLC_HOST_SLC1HOST_RX_START_INT_CLR_S)
#define SDIO_SLC_HOST_SLC1HOST_RX_START_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC1HOST_RX_START_INT_CLR_S  14
/** SDIO_SLC_HOST_SLC1HOST_TX_START_INT_CLR : WT; bitpos: [15]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1HOST_TX_START_INT_CLR    (BIT(15))
#define SDIO_SLC_HOST_SLC1HOST_TX_START_INT_CLR_M  (SDIO_SLC_HOST_SLC1HOST_TX_START_INT_CLR_V << SDIO_SLC_HOST_SLC1HOST_TX_START_INT_CLR_S)
#define SDIO_SLC_HOST_SLC1HOST_TX_START_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC1HOST_TX_START_INT_CLR_S  15
/** SDIO_SLC_HOST_SLC1_RX_UDF_INT_CLR : WT; bitpos: [16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_RX_UDF_INT_CLR    (BIT(16))
#define SDIO_SLC_HOST_SLC1_RX_UDF_INT_CLR_M  (SDIO_SLC_HOST_SLC1_RX_UDF_INT_CLR_V << SDIO_SLC_HOST_SLC1_RX_UDF_INT_CLR_S)
#define SDIO_SLC_HOST_SLC1_RX_UDF_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_RX_UDF_INT_CLR_S  16
/** SDIO_SLC_HOST_SLC1_TX_OVF_INT_CLR : WT; bitpos: [17]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_TX_OVF_INT_CLR    (BIT(17))
#define SDIO_SLC_HOST_SLC1_TX_OVF_INT_CLR_M  (SDIO_SLC_HOST_SLC1_TX_OVF_INT_CLR_V << SDIO_SLC_HOST_SLC1_TX_OVF_INT_CLR_S)
#define SDIO_SLC_HOST_SLC1_TX_OVF_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_TX_OVF_INT_CLR_S  17
/** SDIO_SLC_HOST_SLC1_RX_PF_VALID_INT_CLR : WT; bitpos: [18]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_RX_PF_VALID_INT_CLR    (BIT(18))
#define SDIO_SLC_HOST_SLC1_RX_PF_VALID_INT_CLR_M  (SDIO_SLC_HOST_SLC1_RX_PF_VALID_INT_CLR_V << SDIO_SLC_HOST_SLC1_RX_PF_VALID_INT_CLR_S)
#define SDIO_SLC_HOST_SLC1_RX_PF_VALID_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_RX_PF_VALID_INT_CLR_S  18
/** SDIO_SLC_HOST_SLC1_EXT_BIT0_INT_CLR : WT; bitpos: [19]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_EXT_BIT0_INT_CLR    (BIT(19))
#define SDIO_SLC_HOST_SLC1_EXT_BIT0_INT_CLR_M  (SDIO_SLC_HOST_SLC1_EXT_BIT0_INT_CLR_V << SDIO_SLC_HOST_SLC1_EXT_BIT0_INT_CLR_S)
#define SDIO_SLC_HOST_SLC1_EXT_BIT0_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_EXT_BIT0_INT_CLR_S  19
/** SDIO_SLC_HOST_SLC1_EXT_BIT1_INT_CLR : WT; bitpos: [20]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_EXT_BIT1_INT_CLR    (BIT(20))
#define SDIO_SLC_HOST_SLC1_EXT_BIT1_INT_CLR_M  (SDIO_SLC_HOST_SLC1_EXT_BIT1_INT_CLR_V << SDIO_SLC_HOST_SLC1_EXT_BIT1_INT_CLR_S)
#define SDIO_SLC_HOST_SLC1_EXT_BIT1_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_EXT_BIT1_INT_CLR_S  20
/** SDIO_SLC_HOST_SLC1_EXT_BIT2_INT_CLR : WT; bitpos: [21]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_EXT_BIT2_INT_CLR    (BIT(21))
#define SDIO_SLC_HOST_SLC1_EXT_BIT2_INT_CLR_M  (SDIO_SLC_HOST_SLC1_EXT_BIT2_INT_CLR_V << SDIO_SLC_HOST_SLC1_EXT_BIT2_INT_CLR_S)
#define SDIO_SLC_HOST_SLC1_EXT_BIT2_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_EXT_BIT2_INT_CLR_S  21
/** SDIO_SLC_HOST_SLC1_EXT_BIT3_INT_CLR : WT; bitpos: [22]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_EXT_BIT3_INT_CLR    (BIT(22))
#define SDIO_SLC_HOST_SLC1_EXT_BIT3_INT_CLR_M  (SDIO_SLC_HOST_SLC1_EXT_BIT3_INT_CLR_V << SDIO_SLC_HOST_SLC1_EXT_BIT3_INT_CLR_S)
#define SDIO_SLC_HOST_SLC1_EXT_BIT3_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_EXT_BIT3_INT_CLR_S  22
/** SDIO_SLC_HOST_SLC1_WIFI_RX_NEW_PACKET_INT_CLR : WT; bitpos: [23]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_WIFI_RX_NEW_PACKET_INT_CLR    (BIT(23))
#define SDIO_SLC_HOST_SLC1_WIFI_RX_NEW_PACKET_INT_CLR_M  (SDIO_SLC_HOST_SLC1_WIFI_RX_NEW_PACKET_INT_CLR_V << SDIO_SLC_HOST_SLC1_WIFI_RX_NEW_PACKET_INT_CLR_S)
#define SDIO_SLC_HOST_SLC1_WIFI_RX_NEW_PACKET_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_WIFI_RX_NEW_PACKET_INT_CLR_S  23
/** SDIO_SLC_HOST_SLC1_HOST_RD_RETRY_INT_CLR : WT; bitpos: [24]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_HOST_RD_RETRY_INT_CLR    (BIT(24))
#define SDIO_SLC_HOST_SLC1_HOST_RD_RETRY_INT_CLR_M  (SDIO_SLC_HOST_SLC1_HOST_RD_RETRY_INT_CLR_V << SDIO_SLC_HOST_SLC1_HOST_RD_RETRY_INT_CLR_S)
#define SDIO_SLC_HOST_SLC1_HOST_RD_RETRY_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_HOST_RD_RETRY_INT_CLR_S  24
/** SDIO_SLC_HOST_SLC1_BT_RX_NEW_PACKET_INT_CLR : WT; bitpos: [25]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_BT_RX_NEW_PACKET_INT_CLR    (BIT(25))
#define SDIO_SLC_HOST_SLC1_BT_RX_NEW_PACKET_INT_CLR_M  (SDIO_SLC_HOST_SLC1_BT_RX_NEW_PACKET_INT_CLR_V << SDIO_SLC_HOST_SLC1_BT_RX_NEW_PACKET_INT_CLR_S)
#define SDIO_SLC_HOST_SLC1_BT_RX_NEW_PACKET_INT_CLR_V  0x00000001U
#define SDIO_SLC_HOST_SLC1_BT_RX_NEW_PACKET_INT_CLR_S  25

