espressif/esp-idf/components/soc/esp32c5/register/soc/sdio_slc_host_reg.h
/** SDIO_SLC_HOST_DATE_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_DATE_REG (DR_REG_SLCHOST_BASE + 0x178)
/** SDIO_SLC_HOST_SLCHOST_DATE : R/W; bitpos: [31:0]; default: 554043136;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_DATE    0xFFFFFFFFU
#define SDIO_SLC_HOST_SLCHOST_DATE_M  (SDIO_SLC_HOST_SLCHOST_DATE_V << SDIO_SLC_HOST_SLCHOST_DATE_S)
#define SDIO_SLC_HOST_SLCHOST_DATE_V  0xFFFFFFFFU
#define SDIO_SLC_HOST_SLCHOST_DATE_S  0

/** SDIO_SLC_HOST_ID_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_ID_REG (DR_REG_SLCHOST_BASE + 0x17c)
/** SDIO_SLC_HOST_SLCHOST_ID : R/W; bitpos: [31:0]; default: 1536;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLCHOST_ID    0xFFFFFFFFU
#define SDIO_SLC_HOST_SLCHOST_ID_M  (SDIO_SLC_HOST_SLCHOST_ID_V << SDIO_SLC_HOST_SLCHOST_ID_S)
#define SDIO_SLC_HOST_SLCHOST_ID_V  0xFFFFFFFFU
#define SDIO_SLC_HOST_SLCHOST_ID_S  0

/** SDIO_SLC_HOST_CONF_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_CONF_REG (DR_REG_SLCHOST_BASE + 0x1f0)
/** SDIO_SLC_HOST_FRC_SDIO11 : R/W; bitpos: [4:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_FRC_SDIO11    0x0000001FU
#define SDIO_SLC_HOST_FRC_SDIO11_M  (SDIO_SLC_HOST_FRC_SDIO11_V << SDIO_SLC_HOST_FRC_SDIO11_S)
#define SDIO_SLC_HOST_FRC_SDIO11_V  0x0000001FU
#define SDIO_SLC_HOST_FRC_SDIO11_S  0
/** SDIO_SLC_HOST_FRC_SDIO20 : R/W; bitpos: [9:5]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_FRC_SDIO20    0x0000001FU
#define SDIO_SLC_HOST_FRC_SDIO20_M  (SDIO_SLC_HOST_FRC_SDIO20_V << SDIO_SLC_HOST_FRC_SDIO20_S)
#define SDIO_SLC_HOST_FRC_SDIO20_V  0x0000001FU
#define SDIO_SLC_HOST_FRC_SDIO20_S  5
/** SDIO_SLC_HOST_FRC_NEG_SAMP : R/W; bitpos: [14:10]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_FRC_NEG_SAMP    0x0000001FU
#define SDIO_SLC_HOST_FRC_NEG_SAMP_M  (SDIO_SLC_HOST_FRC_NEG_SAMP_V << SDIO_SLC_HOST_FRC_NEG_SAMP_S)
#define SDIO_SLC_HOST_FRC_NEG_SAMP_V  0x0000001FU
#define SDIO_SLC_HOST_FRC_NEG_SAMP_S  10
/** SDIO_SLC_HOST_FRC_POS_SAMP : R/W; bitpos: [19:15]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_FRC_POS_SAMP    0x0000001FU
#define SDIO_SLC_HOST_FRC_POS_SAMP_M  (SDIO_SLC_HOST_FRC_POS_SAMP_V << SDIO_SLC_HOST_FRC_POS_SAMP_S)
#define SDIO_SLC_HOST_FRC_POS_SAMP_V  0x0000001FU
#define SDIO_SLC_HOST_FRC_POS_SAMP_S  15
/** SDIO_SLC_HOST_FRC_QUICK_IN : R/W; bitpos: [24:20]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_FRC_QUICK_IN    0x0000001FU
#define SDIO_SLC_HOST_FRC_QUICK_IN_M  (SDIO_SLC_HOST_FRC_QUICK_IN_V << SDIO_SLC_HOST_FRC_QUICK_IN_S)
#define SDIO_SLC_HOST_FRC_QUICK_IN_V  0x0000001FU
#define SDIO_SLC_HOST_FRC_QUICK_IN_S  20
/** SDIO_SLC_HOST_SDIO20_INT_DELAY : R/W; bitpos: [25]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SDIO20_INT_DELAY    (BIT(25))
#define SDIO_SLC_HOST_SDIO20_INT_DELAY_M  (SDIO_SLC_HOST_SDIO20_INT_DELAY_V << SDIO_SLC_HOST_SDIO20_INT_DELAY_S)
#define SDIO_SLC_HOST_SDIO20_INT_DELAY_V  0x00000001U
#define SDIO_SLC_HOST_SDIO20_INT_DELAY_S  25
/** SDIO_SLC_HOST_SDIO_PAD_PULLUP : R/W; bitpos: [26]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SDIO_PAD_PULLUP    (BIT(26))
#define SDIO_SLC_HOST_SDIO_PAD_PULLUP_M  (SDIO_SLC_HOST_SDIO_PAD_PULLUP_V << SDIO_SLC_HOST_SDIO_PAD_PULLUP_S)
#define SDIO_SLC_HOST_SDIO_PAD_PULLUP_V  0x00000001U
#define SDIO_SLC_HOST_SDIO_PAD_PULLUP_S  26
/** SDIO_SLC_HOST_HSPEED_CON_EN : R/W; bitpos: [27]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_HSPEED_CON_EN    (BIT(27))
#define SDIO_SLC_HOST_HSPEED_CON_EN_M  (SDIO_SLC_HOST_HSPEED_CON_EN_V << SDIO_SLC_HOST_HSPEED_CON_EN_S)
#define SDIO_SLC_HOST_HSPEED_CON_EN_V  0x00000001U
#define SDIO_SLC_HOST_HSPEED_CON_EN_S  27

/** SDIO_SLC_HOST_INF_ST_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_INF_ST_REG (DR_REG_SLCHOST_BASE + 0x1f4)
/** SDIO_SLC_HOST_SDIO20_MODE : RO; bitpos: [4:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SDIO20_MODE    0x0000001FU
#define SDIO_SLC_HOST_SDIO20_MODE_M  (SDIO_SLC_HOST_SDIO20_MODE_V << SDIO_SLC_HOST_SDIO20_MODE_S)
#define SDIO_SLC_HOST_SDIO20_MODE_V  0x0000001FU
#define SDIO_SLC_HOST_SDIO20_MODE_S  0
/** SDIO_SLC_HOST_SDIO_NEG_SAMP : RO; bitpos: [9:5]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SDIO_NEG_SAMP    0x0000001FU
#define SDIO_SLC_HOST_SDIO_NEG_SAMP_M  (SDIO_SLC_HOST_SDIO_NEG_SAMP_V << SDIO_SLC_HOST_SDIO_NEG_SAMP_S)
#define SDIO_SLC_HOST_SDIO_NEG_SAMP_V  0x0000001FU
#define SDIO_SLC_HOST_SDIO_NEG_SAMP_S  5
/** SDIO_SLC_HOST_SDIO_QUICK_IN : RO; bitpos: [14:10]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SDIO_QUICK_IN    0x0000001FU
#define SDIO_SLC_HOST_SDIO_QUICK_IN_M  (SDIO_SLC_HOST_SDIO_QUICK_IN_V << SDIO_SLC_HOST_SDIO_QUICK_IN_S)
#define SDIO_SLC_HOST_SDIO_QUICK_IN_V  0x0000001FU
#define SDIO_SLC_HOST_SDIO_QUICK_IN_S  10
/** SDIO_SLC_HOST_DLL_ON_SW : R/W; bitpos: [15]; default: 0;
 *  dll is controlled by software
 */
#define SDIO_SLC_HOST_DLL_ON_SW    (BIT(15))
#define SDIO_SLC_HOST_DLL_ON_SW_M  (SDIO_SLC_HOST_DLL_ON_SW_V << SDIO_SLC_HOST_DLL_ON_SW_S)
#define SDIO_SLC_HOST_DLL_ON_SW_V  0x00000001U
#define SDIO_SLC_HOST_DLL_ON_SW_S  15
/** SDIO_SLC_HOST_DLL_ON : R/W; bitpos: [16]; default: 0;
 *  Software dll on
 */
#define SDIO_SLC_HOST_DLL_ON    (BIT(16))
#define SDIO_SLC_HOST_DLL_ON_M  (SDIO_SLC_HOST_DLL_ON_V << SDIO_SLC_HOST_DLL_ON_S)
#define SDIO_SLC_HOST_DLL_ON_V  0x00000001U
#define SDIO_SLC_HOST_DLL_ON_S  16
/** SDIO_SLC_HOST_CLK_MODE_SW : R/W; bitpos: [17]; default: 0;
 *  dll clock mode is controlled by software
 */
#define SDIO_SLC_HOST_CLK_MODE_SW    (BIT(17))
#define SDIO_SLC_HOST_CLK_MODE_SW_M  (SDIO_SLC_HOST_CLK_MODE_SW_V << SDIO_SLC_HOST_CLK_MODE_SW_S)
#define SDIO_SLC_HOST_CLK_MODE_SW_V  0x00000001U
#define SDIO_SLC_HOST_CLK_MODE_SW_S  17
/** SDIO_SLC_HOST_CLK_MODE : R/W; bitpos: [19:18]; default: 0;
 *  Software set clock mode
 */
#define SDIO_SLC_HOST_CLK_MODE    0x00000003U
#define SDIO_SLC_HOST_CLK_MODE_M  (SDIO_SLC_HOST_CLK_MODE_V << SDIO_SLC_HOST_CLK_MODE_S)
#define SDIO_SLC_HOST_CLK_MODE_V  0x00000003U
#define SDIO_SLC_HOST_CLK_MODE_S  18

#ifdef __cplusplus
}
#endif
